[
  {
    "authorId": 1,
    "fullName": "Dan Brown",
    "funFact": "Favourite colour is not brown"
  },
  {
    "authorId": 2,
    "fullName": "Antoine de Saint-Exupéry",
    "funFact": "He was a successful commercial pilot before World War II, working airmail routes in Europe, Africa, and South America. "
  },
  {
    "authorId": 3,
    "fullName": "Douglas Adams",
    "funFact": "He made two appearances in Monty Python’s Flying Circus"
  },
  {
    "authorId": 4,
    "fullName": "Stephen Hawking",
    "funFact": "Doctors told him he wouldn’t live past his early 20s"
  },
  {
    "authorId": 5,
    "fullName": "Eric Carle",
    "funFact": "When he was a young boy, Carle had a dream that he would build a bridge from Germany to America."
  },
  {
    "authorId": 6,
    "fullName": "J. D. Salinger",
    "funFact": "The Catcher in the Rye was the only novel that J.D. Salinger published during his lifetime, not bad for a first try!"
  },
  {
    "authorId": 7,
    "fullName": "Beatrix Potter",
    "funFact": "Between 1881 and 1897 Potter kept a journal in which she jotted down her private thoughts in a secret code . This code was so fiendishly difficult it was not cracked and translated until 1958."
  },
  {
    "authorId": 8,
    "fullName": "C. S. Lewis",
    "funFact": "Lewis set up a charitable trust to give away whatever money he received from his books."
  },
  {
    "authorId": 9,
    "fullName": "Roald Dahl",
    "funFact": "During World War II he passed intelligence to MI6 from Washington."
  },
  {
    "authorId": 10,
    "fullName": "Frank Herbert",
    "funFact": "While conversing with fungi expert Paul Stamets, Herbert revealed that the world of Dune was influenced by the lifecycle of mushrooms, with his imagination being helped along by a more “magic” variety."
  },
  {
    "authorId": 11,
    "fullName": "Louis de Bernières",
    "funFact": "De Bernières is an avid musician who plays flute, mandolin, clarinet and guitar."
  },
  {
    "authorId": 12,
    "fullName": "H. G. Wells",
    "funFact": "In 1914 H.G. Wells published a novel titled The World Set Free. In this book he described a weapon that was eerily similar to the first atomic bomb unleashed on the Japanese cities of Hiroshima and Nagasaki in 1945."
  },
  {
    "authorId": 13,
    "fullName": "George Orwell",
    "funFact": "Orwell intentionally got himself arrested for being 'drunk and incapable.'"
  },
  {
    "authorId": 14,
    "fullName": "Jane Austen",
    "funFact": "The author of her first novel, Sense and Sensibility was simply “A Lady,” and her later works like Pride and Prejudice were credited to “the Author of Sense and Sensibility.” She wasn’t named as the author of her novels until after her death!"
  },
  {
    "authorId": 15,
    "fullName": "Margaret Atwood",
    "funFact": "Atwood was the first author to contribute to The Future Library Project, which will take one writer’s contribution each year for one hundred years to be printed in the year 2114."
  }
]
